In [3]:
from bs4 import BeautifulSoup
import pandas as pd

In [7]:
df = pd.read_html('/Users/garimajain/Desktop/lab-Session-4/Sheet1.html', flavor='bs4')

In [9]:
df1 = df[0]

In [12]:
df1

,Unnamed: 0,A,B,C,D,E
0,1,Job Profile,Location,State,Average Salary,National Average Salary
1,2,Business Analyst,San Francisco,CA,"$83,656","$70,592"
2,3,Business Analyst,Los Angeles,CA,"$74,096","$70,592"
3,4,Business Analyst,San Diego,CA,"$72,796","$70,592"
4,5,Data Analyst,San Francisco,CA,"$91,485","$76,419"
5,6,Data Analyst,Los Angeles,CA,"$73,036","$76,419"
6,7,Data Analyst,San Diego,CA,"$66,582","$76,419"

In [16]:
del df1['C']

In [17]:
del df1['Unnamed: 0']

In [19]:
df1.columns = ['MSIS Job positions','Location', 'Average Salary', 'National Average Salary']

In [25]:
df2 = df1.drop([0])

In [26]:
df2

  MSIS Job positions       Location Average Salary National Average Salary
1   Business Analyst  San Francisco        $83,656                 $70,592
2   Business Analyst    Los Angeles        $74,096                 $70,592
3   Business Analyst      San Diego        $72,796                 $70,592
4       Data Analyst  San Francisco        $91,485                 $76,419
5       Data Analyst    Los Angeles        $73,036                 $76,419
6       Data Analyst      San Diego        $66,582                 $76,419

In [27]:
df2.to_csv('Average Salaries 5.csv', index=False, encoding='utf-8')